$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.1',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '8.3.0',
          'Headers' => {
                         'libyang.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libyang.so.1.8.4',
          'LibraryVersion' => '1.0.176',
          'NameSpaces' => {},
          'Needed' => {
                        'ld-linux-x86-64.so.2' => 1,
                        'libc.so.6' => 1,
                        'libdl.so.2' => 1,
                        'libm.so.6' => 1,
                        'libpcre.so.3' => 1,
                        'libpthread.so.0' => 1
                      },
          'PublicABI' => '1',
          'Sources' => {},
          'SymbolInfo' => {
                            '14686' => {
                                         'Header' => 'libyang.h',
                                         'Param' => {
                                                      '0' => {
                                                               'name' => 'ctx',
                                                               'type' => '3830'
                                                             },
                                                      '1' => {
                                                               'name' => 'data_path',
                                                               'type' => '362'

                                                 'lys_features_state' => 1,
                                                 'lys_find_path' => 1,
                                                 'lys_getnext' => 1,
                                                 'lys_getnext_union_type' => 1,
                                                 'lys_iffeature_free' => 1,
                                                 'lys_iffeature_value' => 1,
                                                 'lys_implemented_module' => 1,
                                                 'lys_is_disabled' => 1,
                                                 'lys_is_key' => 1,
                                                 'lys_main_module' => 1,
                                                 'lys_node_module' => 1,
                                                 'lys_node_xpath_atomize' => 1,
                                                 'lys_parent' => 1,
                                                 'lys_parse_fd' => 1,
                                                 'lys_parse_mem' => 1,
                                                 'lys_parse_path' => 1,
                                                 'lys_path' => 1,
                                                 'lys_print_clb' => 1,
                                                 'lys_print_fd' => 1,
                                                 'lys_print_file' => 1,
                                                 'lys_print_mem' => 1,
                                                 'lys_print_path' => 1,
                                                 'lys_search_localfile' => 1,
                                                 'lys_set_disabled' => 1,
                                                 'lys_set_enabled' => 1,
                                                 'lys_set_implemented' => 1,
                                                 'lys_set_private' => 1,
                                                 'lys_xpath_atomize' => 1,
                                                 'lyxml_dup' => 1,
                                                 'lyxml_free' => 1,
                                                 'lyxml_free_withsiblings' => 1,
                                                 'lyxml_get_attr' => 1,
                                                 'lyxml_get_ns' => 1,
                                                 'lyxml_parse_mem' => 1,
                                                 'lyxml_parse_path' => 1,
                                                 'lyxml_print_clb' => 1,
                                                 'lyxml_print_fd' => 1,
                                                 'lyxml_print_file' => 1,
                                                 'lyxml_print_mem' => 1,
                                                 'lyxml_unlink' => 1
                                               }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '100' => {
                                     'Name' => 'signed char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '10525' => {
                                       'Header' => 'libyang.h',
                                       'Line' => '2136',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'level',
                                                            'offset' => '0',
                                                            'type' => '9944'
                                                          },
                                                   '1' => {
                                                            'name' => 'no',
                                                            'offset' => '4',
                                                            'type' => '10015'
                                                          },
                                                   '2' => {
                                                            'name' => 'vecode',
                                                            'offset' => '8',
                                                            'type' => '10512'
                                                          },
                                                   '3' => {
                                                            'name' => 'msg',
                                                            'offset' => '16',
                                                            'type' => '243'
                                                          },
                                                   '4' => {
                                                            'name' => 'path',
                                                            'offset' => '24',
                                                            'type' => '243'
                                                          },
                                                   '5' => {
                                                            'name' => 'apptag',
                                                            'offset' => '32',
                                                            'type' => '243'
                                                          },
                                                   '6' => {
                                                            'name' => 'next',
                                                            'offset' => '40',
                                                            'type' => '10651'
                                                          },
                                                   '7' => {
                                                            'name' => 'prev',
                                                            'offset' => '48',
                                                            'type' => '10651'
                                                          }
                                                 },
                                       'Name' => 'struct ly_err_item',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '10651' => {
                                       'BaseType' => '10525',
                                       'Name' => 'struct ly_err_item*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10657' => {
                                       'BaseType' => '10669',
                                       'Header' => undef,
                                       'Line' => '44',
                                       'Name' => 'values_equal_cb',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '10669' => {
                                       'Name' => 'int(*)(void*, void*, int, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '241'
                                                           },
                                                    '1' => {
                                                             'type' => '241'
                                                           },
                                                    '2' => {
                                                             'type' => '162'
                                                           },
                                                    '3' => {
                                                             'type' => '241'
                                                           }
                                                  },
                                       'Return' => '162',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '107' => {
                                     'BaseType' => '45',
                                     'Header' => undef,
                                     'Line' => '37',
                                     'Name' => '__uint8_t',
                                     'PrivateABI' => 1,
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '10705' => {
                                       'BaseType' => '45',
                                       'Name' => 'unsigned char*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10711' => {
                                       'Header' => undef,
                                       'Line' => '95',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hash_tab',
                                                            'offset' => '0',
                                                            'type' => '9680'
                                                          },
                                                   '1' => {
                                                            'name' => 'lock',
                                                            'offset' => '8',
                                                            'type' => '767'
                                                          }
                                                 },
                                       'Name' => 'struct dict_table',
                                       'PrivateABI' => 1,
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '11117' => {
                                       'BaseType' => '11129',
                                       'Header' => undef,
                                       'Line' => '142',
                                       'Name' => 'lyext_check_position_clb',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11129' => {
                                       'Name' => 'int(*)(void const*, , )',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '1445'
                                                           },
                                                    '1' => {
                                                             'type' => '10880'
                                                           },
                                                    '2' => {
                                                             'type' => '11105'
                                                           }
                                                  },
                                       'Return' => '162',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11160' => {
                                       'BaseType' => '11172',
                                       'Header' => undef,
                                       'Line' => '152',
                                       'Name' => 'lyext_check_result_clb',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11172' => {
                                       'Name' => 'int(*)(struct lys_ext_instance*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '2774'
                                                           }
                                                  },
                                       'Return' => '162',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11193' => {
                                       'BaseType' => '11205',
                                       'Header' => undef,
                                       'Line' => '165',
                                       'Name' => 'lyext_check_inherit_clb',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11205' => {
                                       'Name' => 'int(*)(struct lys_ext_instance*, struct lys_node*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '2774'
                                                           },
                                                    '1' => {
                                                             'type' => '5384'
                                                           }
                                                  },
                                       'Return' => '162',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11231' => {
                                       'BaseType' => '11243',
                                       'Header' => undef,
                                       'Line' => '176',
                                       'Name' => 'lyext_valid_data_clb',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11243' => {
                                       'Name' => 'int(*)(struct lys_ext_instance*, struct lyd_node*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '2774'
                                                           },
                                                    '1' => {
                                                             'type' => '9427'
                                                           }
                                                  },
                                       'Return' => '162',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11269' => {
                                       'BaseType' => '3352',
                                       'Name' => 'struct lys_module**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '119' => {
                                     'BaseType' => '131',
                                     'Header' => undef,
                                     'Line' => '38',
                                     'Name' => '__int16_t',
                                     'PrivateABI' => 1,
                                     'Size' => '2',
                                     'Type' => 'Typedef'
                                   },
                          '1231' => {
                                      'BaseType' => '249',
                                      'Name' => 'char[1]',
                                      'Size' => '1',
                                      'Type' => 'Array'
                                    },
                          '131' => {
                                     'Name' => 'short',
                                     'Size' => '2',
                                     'Type' => 'Intrinsic'
                                   },
                          '13376' => {
                                       'Header' => undef,
                                       'Line' => '25',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'search_paths',
                                                            'offset' => '0',
                                                            'type' => '1465'
                                                          },
                                                   '1' => {
                                                            'name' => 'size',
                                                            'offset' => '8',
                                                            'type' => '162'
                                                          },
                                                   '2' => {
                                                            'name' => 'used',
                                                            'offset' => '12',
                                                            'type' => '162'
                                                          },
                                                   '3' => {
                                                            'name' => 'list',
                                                            'offset' => '16',
                                                            'type' => '11269'
                                                          },
                                                   '4' => {
                                                            'name' => 'parsing_sub_modules',
                                                            'offset' => '24',
                                                            'type' => '11269'
                                                          },
                                                   '5' => {
                                                            'name' => 'parsed_submodules',
                                                            'offset' => '32',
                                                            'type' => '11269'
                                                          },
                                                   '6' => {
                                                            'name' => 'parsing_sub_modules_count',
                                                            'offset' => '40',
                                                            'type' => '1532'
                                                          },
                                                   '7' => {
                                                            'name' => 'parsed_submodules_count',
                                                            'offset' => '41',
                                                            'type' => '1532'
                                                          },
                                                   '8' => {
                                                            'name' => 'module_set_id',
                                                            'offset' => '42',
                                                            'type' => '1549'
                                                          },
                                                   '9' => {
                                                            'name' => 'flags',
                                                            'offset' => '44',
                                                            'type' => '162'
                                                          }
                                                 },
                                       'Name' => 'struct ly_modules_list',
                                       'PrivateABI' => 1,
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '138' => {
                                     'BaseType' => '57',
                                     'Header' => undef,
                                     'Line' => '39',
                                     'Name' => '__uint16_t',
                                     'PrivateABI' => 1,
                                     'Size' => '2',
                                     'Type' => 'Typedef'
                                   },
                          '1397' => {
                                      'BaseType' => '88',
                                      'Header' => undef,
                                      'Line' => '24',
                                      'Name' => 'int8_t',
                                      'PrivateABI' => 1,
                                      'Size' => '1',
                                      'Type' => 'Typedef'
                                    },
                          '1409' => {
                                      'BaseType' => '119',
                                      'Header' => undef,
                                      'Line' => '25',
                                      'Name' => 'int16_t',
                                      'PrivateABI' => 1,
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '1421' => {
                                      'BaseType' => '150',
                                      'Header' => undef,
                                      'Line' => '26',
                                      'Name' => 'int32_t',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '1433' => {
                                      'BaseType' => '186',
                                      'Header' => undef,
                                      'Line' => '27',
                                      'Name' => 'int64_t',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '1445' => {
                                      'BaseType' => '1451',
                                      'Name' => 'void const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1451' => {
                                      'BaseType' => '1',
                                      'Name' => 'void const',
                                      'Type' => 'Const'
                                    },
                          '1465' => {
                                      'BaseType' => '243',
                                      'Name' => 'char**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '14680' => {
                                       'BaseType' => '5379',
                                       'Name' => 'struct lys_node const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '150' => {
                                     'BaseType' => '162',
                                     'Header' => undef,
                                     'Line' => '40',
                                     'Name' => '__int32_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '1532' => {
                                      'BaseType' => '107',
                                      'Header' => undef,
                                      'Line' => '24',
                                      'Name' => 'uint8_t',
                                      'PrivateABI' => 1,
                                      'Size' => '1',
                                      'Type' => 'Typedef'
                                    },
                          '1549' => {
                                      'BaseType' => '138',
                                      'Header' => undef,
                                      'Line' => '25',
                                      'Name' => 'uint16_t',
                                      'PrivateABI' => 1,
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '1561' => {
                                      'BaseType' => '174',
                                      'Header' => undef,
                                      'Line' => '26',
                                      'Name' => 'uint32_t',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '1573' => {
                                      'BaseType' => '205',
                                      'Header' => undef,
                                      'Line' => '27',
                                      'Name' => 'uint64_t',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '162' => {
                                     'Name' => 'int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '1630' => {
                                      'Header' => undef,
                                      'Line' => '229',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'LYS_UNKNOWN',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'LYS_CONTAINER',
                                                           'value' => '1'
                                                         },
                                                  '10' => {
                                                            'name' => 'LYS_INPUT',
                                                            'value' => '512'
                                                          },
                                                  '11' => {
                                                            'name' => 'LYS_OUTPUT',
                                                            'value' => '1024'
                                                          },
                                                  '12' => {
                                                            'name' => 'LYS_GROUPING',
                                                            'value' => '2048'
                                                          },
                                                  '13' => {
                                                            'name' => 'LYS_USES',
                                                            'value' => '4096'
                                                          },
                                                  '14' => {
                                                            'name' => 'LYS_AUGMENT',
                                                            'value' => '8192'
                                                          },
                                                  '15' => {
                                                            'name' => 'LYS_ACTION',
                                                            'value' => '16384'
                                                          },
                                                  '16' => {
                                                            'name' => 'LYS_ANYDATA',
                                                            'value' => '32800'
                                                          },
                                                  '17' => {
                                                            'name' => 'LYS_EXT',
                                                            'value' => '65536'
                                                          },
                                                  '2' => {
                                                           'name' => 'LYS_CHOICE',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'LYS_LEAF',
                                                           'value' => '4'
                                                         },
                                                  '4' => {
                                                           'name' => 'LYS_LEAFLIST',
                                                           'value' => '8'
                                                         },
                                                  '5' => {
                                                           'name' => 'LYS_LIST',
                                                           'value' => '16'
                                                         },
                                                  '6' => {
                                                           'name' => 'LYS_ANYXML',
                                                           'value' => '32'
                                                         },
                                                  '7' => {
                                                           'name' => 'LYS_CASE',
                                                           'value' => '64'
                                                         },
                                                  '8' => {
                                                           'name' => 'LYS_NOTIF',
                                                           'value' => '128'
                                                         },
                                                  '9' => {
                                                           'name' => 'LYS_RPC',
                                                           'value' => '256'
                                                         }
                                                },
                                      'Name' => 'enum lys_nodetype',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '174' => {
                                     'BaseType' => '69',
                                     'Header' => undef,
                                     'Line' => '41',
                                     'Name' => '__uint32_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '1768' => {
                                      'BaseType' => '1630',
                                      'Header' => undef,
                                      'Line' => '248',
                                      'Name' => 'LYS_NODE',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '18146' => {
                                       'BaseType' => '3825',
                                       'Name' => 'struct ly_ctx const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '186' => {
                                     'BaseType' => '198',
                                     'Header' => undef,
                                     'Line' => '43',
                                     'Name' => '__int64_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '198' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '20128' => {
                                       'BaseType' => '1561',
                                       'Name' => 'uint32_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '205' => {
                                     'BaseType' => '81',
                                     'Header' => undef,
                                     'Line' => '44',
                                     'Name' => '__uint64_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '2329' => {
                                      'Header' => undef,
                                      'Line' => '435',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'stmt',
                                                           'offset' => '0',
                                                           'type' => '2216'
                                                         },
                                                  '1' => {
                                                           'name' => 'offset',
                                                           'offset' => '8',
                                                           'type' => '397'
                                                         },
                                                  '2' => {
                                                           'name' => 'cardinality',
                                                           'offset' => '16',
                                                           'type' => '2269'
                                                         }
                                                },
                                      'Name' => 'struct lyext_substmt',
                                      'PrivateABI' => 1,
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '2386' => {
                                      'Header' => undef,
                                      'Line' => '444',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'name',
                                                           'offset' => '0',
                                                           'type' => '362'
                                                         },
                                                  '1' => {
                                                           'name' => 'dsc',
                                                           'offset' => '8',
                                                           'type' => '362'
                                                         },
                                                  '2' => {
                                                           'name' => 'ref',
                                                           'offset' => '16',
                                                           'type' => '362'
                                                         },
                                                  '3' => {
                                                           'name' => 'flags',
                                                           'offset' => '24',
                                                           'type' => '1549'
                                                         },
                                                  '4' => {
                                                           'name' => 'ext_size',
                                                           'offset' => '26',
                                                           'type' => '1532'
                                                         },
                                                  '5' => {
                                                           'name' => 'padding',
                                                           'offset' => '27',
                                                           'type' => '2541'
                                                         },
                                                  '6' => {
                                                           'name' => 'ext',
                                                           'offset' => '32',
                                                           'type' => '2768'
                                                         },
                                                  '7' => {
                                                           'name' => 'argument',
                                                           'offset' => '40',
                                                           'type' => '362'
                                                         },
                                                  '8' => {
                                                           'name' => 'module',
                                                           'offset' => '48',
                                                           'type' => '3352'
                                                         },
                                                  '9' => {
                                                           'name' => 'plugin',
                                                           'offset' => '56',
                                                           'type' => '3450'
                                                         }
                                                },
                                      'Name' => 'struct lys_ext',
                                      'PrivateABI' => 1,
                                      'Size' => '64',
                                      'Type' => 'Struct'
                                    },
                          '241' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '243' => {
                                     'BaseType' => '249',
                                     'Name' => 'char*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '249' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '2541' => {
                                      'BaseType' => '1532',
                                      'Name' => 'uint8_t[5]',
                                      'Size' => '5',
                                      'Type' => 'Array'
                                    },
                          '2557' => {
                                      'Header' => undef,
                                      'Line' => '464',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'def',
                                                           'offset' => '0',
                                                           'type' => '3456'
                                                         },
                                                  '1' => {
                                                           'name' => 'parent',
                                                           'offset' => '8',
                                                           'type' => '241'
                                                         },
                                                  '10' => {
                                                            'name' => 'ext',
                                                            'offset' => '32',
                                                            'type' => '2768'
                                                          },
                                                  '11' => {
                                                            'name' => 'priv',
                                                            'offset' => '40',
                                                            'type' => '241'
                                                          },
                                                  '12' => {
                                                            'name' => 'module',
                                                            'offset' => '48',
                                                            'type' => '3352'
                                                          },
                                                  '13' => {
                                                            'name' => 'nodetype',
                                                            'offset' => '56',
                                                            'type' => '1768'
                                                          },
                                                  '2' => {
                                                           'name' => 'arg_value',
                                                           'offset' => '16',
                                                           'type' => '362'
                                                         },
                                                  '3' => {
                                                           'name' => 'flags',
                                                           'offset' => '24',
                                                           'type' => '1549'
                                                         },
                                                  '4' => {
                                                           'name' => 'ext_size',
                                                           'offset' => '26',
                                                           'type' => '1532'
                                                         },
                                                  '5' => {
                                                           'name' => 'insubstmt_index',
                                                           'offset' => '27',
                                                           'type' => '1532'
                                                         },
                                                  '6' => {
                                                           'name' => 'insubstmt',
                                                           'offset' => '28',
                                                           'type' => '1532'
                                                         },
                                                  '7' => {
                                                           'name' => 'parent_type',
                                                           'offset' => '29',
                                                           'type' => '1532'
                                                         },
                                                  '8' => {
                                                           'name' => 'ext_type',
                                                           'offset' => '30',
                                                           'type' => '1532'
                                                         },
                                                  '9' => {
                                                           'name' => 'padding',
                                                           'offset' => '31',
                                                           'type' => '1532'
                                                         }
                                                },
                                      'Name' => 'struct lys_ext_instance',
                                      'PrivateABI' => 1,
                                      'Size' => '64',
                                      'Type' => 'Struct'
                                    },
                          '256' => {
                                     'BaseType' => '249',
                                     'Name' => 'char const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '2768' => {
                                      'BaseType' => '2774',
                                      'Name' => 'struct lys_ext_instance**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2774' => {
                                      'BaseType' => '2557',
                                      'Name' => 'struct lys_ext_instance*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2780' => {
                                      'Header' => undef,
                                      'Line' => '666',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ctx',
                                                           'offset' => '0',
                                                           'type' => '3830'
                                                         },
                                                  '1' => {
                                                           'name' => 'name',
                                                           'offset' => '8',
                                                           'type' => '362'
                                                         },
                                                  '10' => {
                                                            'bitfield' => '2',
                                                            'name' => 'deviated',
                                                            'offset' => '64',
                                                            'type' => '1532'
                                                          },
                                                  '11' => {
                                                            'bitfield' => '1',
                                                            'name' => 'disabled',
                                                            'offset' => '64',
                                                            'type' => '1532'
                                                          },
                                                  '12' => {
                                                            'bitfield' => '1',
                                                            'name' => 'implemented',
                                                            'offset' => '64',
                                                            'type' => '1532'
                                                          },
                                                  '13' => {
                                                            'bitfield' => '1',
                                                            'name' => 'latest_revision',
                                                            'offset' => '65',
                                                            'type' => '1532'
                                                          },
                                                  '14' => {
                                                            'bitfield' => '7',
                                                            'name' => 'padding1',
                                                            'offset' => '65',
                                                            'type' => '1532'
                                                          },
                                                  '15' => {
                                                            'name' => 'padding2',
                                                            'offset' => '66',
                                                            'type' => '3836'
                                                          },
                                                  '16' => {
                                                            'name' => 'rev_size',
                                                            'offset' => '68',
                                                            'type' => '1532'
                                                          },
                                                  '17' => {
                                                            'name' => 'imp_size',
                                                            'offset' => '69',
                                                            'type' => '1532'
                                                          },
                                                  '18' => {
                                                            'name' => 'inc_size',
                                                            'offset' => '70',
                                                            'type' => '1532'
                                                          },
                                                  '19' => {
                                                            'name' => 'ident_size',
                                                            'offset' => '72',
                                                            'type' => '1549'
                                                          },
                                                  '2' => {
                                                           'name' => 'prefix',
                                                           'offset' => '16',
                                                           'type' => '362'
                                                         },
                                                  '20' => {
                                                            'name' => 'tpdf_size',
                                                            'offset' => '74',
                                                            'type' => '1549'
                                                          },
                                                  '21' => {
                                                            'name' => 'features_size',
                                                            'offset' => '76',
                                                            'type' => '1532'
                                                          },
                                                  '22' => {
                                                            'name' => 'augment_size',
                                                            'offset' => '77',
                                                            'type' => '1532'
                                                          },
                                                  '23' => {
                                                            'name' => 'deviation_size',
                                                            'offset' => '78',
                                                            'type' => '1532'
                                                          },
                                                  '24' => {
                                                            'name' => 'extensions_size',
                                                            'offset' => '79',
                                                            'type' => '1532'
                                                          },
                                                  '25' => {
                                                            'name' => 'ext_size',
                                                            'offset' => '80',
                                                            'type' => '1532'
                                                          },
                                                  '26' => {
                                                            'name' => 'rev',
                                                            'offset' => '88',
                                                            'type' => '3937'
                                                          },
                                                  '27' => {
                                                            'name' => 'imp',
                                                            'offset' => '96',
                                                            'type' => '4056'
                                                          },
                                                  '28' => {
                                                            'name' => 'inc',
                                                            'offset' => '104',
                                                            'type' => '4161'
                                                          },
                                                  '29' => {
                                                            'name' => 'tpdf',
                                                            'offset' => '112',
                                                            'type' => '4364'
                                                          },
                                                  '3' => {
                                                           'name' => 'dsc',
                                                           'offset' => '24',
                                                           'type' => '362'
                                                         },
                                                  '30' => {
                                                            'name' => 'ident',
                                                            'offset' => '120',
                                                            'type' => '4567'
                                                          },
                                                  '31' => {
                                                            'name' => 'features',
                                                            'offset' => '128',
                                                            'type' => '4742'
                                                          },
                                                  '32' => {
                                                            'name' => 'augment',
                                                            'offset' => '136',
                                                            'type' => '4987'
                                                          },
                                                  '33' => {
                                                            'name' => 'deviation',
                                                            'offset' => '144',
                                                            'type' => '5120'
                                                          },
                                                  '34' => {
                                                            'name' => 'extensions',
                                                            'offset' => '152',
                                                            'type' => '3456'
                                                          },
                                                  '35' => {
                                                            'name' => 'ext',
                                                            'offset' => '160',
                                                            'type' => '2768'
                                                          },
                                                  '36' => {
                                                            'name' => 'data',
                                                            'offset' => '168',
                                                            'type' => '5384'
                                                          },
                                                  '37' => {
                                                            'name' => 'ns',
                                                            'offset' => '176',
                                                            'type' => '362'
                                                          },
                                                  '4' => {
                                                           'name' => 'ref',
                                                           'offset' => '32',
                                                           'type' => '362'
                                                         },
                                                  '5' => {
                                                           'name' => 'org',
                                                           'offset' => '40',
                                                           'type' => '362'
                                                         },
                                                  '6' => {
                                                           'name' => 'contact',
                                                           'offset' => '48',
                                                           'type' => '362'
                                                         },
                                                  '7' => {
                                                           'name' => 'filepath',
                                                           'offset' => '56',
                                                           'type' => '362'
                                                         },
                                                  '8' => {
                                                           'bitfield' => '1',
                                                           'name' => 'type',
                                                           'offset' => '64',
                                                           'type' => '1532'
                                                         },
                                                  '9' => {
                                                           'bitfield' => '3',
                                                           'name' => 'version',
                                                           'offset' => '64',
                                                           'type' => '1532'
                                                         }
                                                },
                                      'Name' => 'struct lys_module',
                                      'PrivateABI' => 1,
                                      'Size' => '184',
                                      'Type' => 'Struct'
                                    },
                          '3347' => {
                                      'BaseType' => '2780',
                                      'Name' => 'struct lys_module const',
                                      'Size' => '184',
                                      'Type' => 'Const'
                                    },
                          '3352' => {
                                      'BaseType' => '2780',
                                      'Name' => 'struct lys_module*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3358' => {
                                      'Header' => undef,
                                      'Line' => '178',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'type',
                                                           'offset' => '0',
                                                           'type' => '2316'
                                                         },
                                                  '1' => {
                                                           'name' => 'flags',
                                                           'offset' => '4',
                                                           'type' => '1549'
                                                         },
                                                  '2' => {
                                                           'name' => 'check_position',
                                                           'offset' => '8',
                                                           'type' => '11117'
                                                         },
                                                  '3' => {
                                                           'name' => 'check_result',
                                                           'offset' => '16',
                                                           'type' => '11160'
                                                         },
                                                  '4' => {
                                                           'name' => 'check_inherit',
                                                           'offset' => '24',
                                                           'type' => '11193'
                                                         },
                                                  '5' => {
                                                           'name' => 'valid_data',
                                                           'offset' => '32',
                                                           'type' => '11231'
                                                         }
                                                },
                                      'Name' => 'struct lyext_plugin',
                                      'PrivateABI' => 1,
                                      'Size' => '40',
                                      'Type' => 'Struct'
                                    },
                          '3450' => {
                                      'BaseType' => '3358',
                                      'Name' => 'struct lyext_plugin*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3456' => {
                                      'BaseType' => '2386',
                                      'Name' => 'struct lys_ext*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3462' => {
                                      'Header' => undef,
                                      'Line' => '498',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'def',
                                                           'offset' => '0',
                                                           'type' => '3456'
                                                         },
                                                  '1' => {
                                                           'name' => 'parent',
                                                           'offset' => '8',
                                                           'type' => '241'
                                                         },
                                                  '10' => {
                                                            'name' => 'ext',
                                                            'offset' => '32',
                                                            'type' => '2768'
                                                          },
                                                  '11' => {
                                                            'name' => 'priv',
                                                            'offset' => '40',
                                                            'type' => '241'
                                                          },
                                                  '12' => {
                                                            'name' => 'module',
                                                            'offset' => '48',
                                                            'type' => '3352'
                                                          },
                                                  '13' => {
                                                            'name' => 'nodetype',
                                                            'offset' => '56',
                                                            'type' => '1768'
                                                          },
                                                  '14' => {
                                                            'name' => 'substmt',
                                                            'offset' => '64',
                                                            'type' => '3701'
                                                          },
                                                  '15' => {
                                                            'name' => 'content',
                                                            'offset' => '72',
                                                            'type' => '1231'
                                                          },
                                                  '2' => {
                                                           'name' => 'arg_value',
                                                           'offset' => '16',
                                                           'type' => '362'
                                                         },
                                                  '3' => {
                                                           'name' => 'flags',
                                                           'offset' => '24',
                                                           'type' => '1549'
                                                         },
                                                  '4' => {
                                                           'name' => 'ext_size',
                                                           'offset' => '26',
                                                           'type' => '1532'
                                                         },
                                                  '5' => {
                                                           'name' => 'insubstmt_index',
                                                           'offset' => '27',
                                                           'type' => '1532'
                                                         },
                                                  '6' => {
                                                           'name' => 'insubstmt',
                                                           'offset' => '28',
                                                           'type' => '1532'
                                                         },
                                                  '7' => {
                                                           'name' => 'parent_type',
                                                           'offset' => '29',
                                                           'type' => '1532'
                                                         },
                                                  '8' => {
                                                           'name' => 'ext_type',
                                                           'offset' => '30',
                                                           'type' => '1532'
                                                         },
                                                  '9' => {
                                                           'name' => 'padding',
                                                           'offset' => '31',
                                                           'type' => '1532'
                                                         }
                                                },
                                      'Name' => 'struct lys_ext_instance_complex',
                                      'PrivateABI' => 1,
                                      'Size' => '80',
                                      'Type' => 'Struct'
                                    },
                          '35491' => {
                                       'BaseType' => '5390',
                                       'Name' => 'struct lys_submodule const',
                                       'Size' => '176',
                                       'Type' => 'Const'
                                     },
                          '362' => {
                                     'BaseType' => '256',
                                     'Name' => 'char const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '368' => {
                                     'BaseType' => '362',
                                     'Name' => 'char const*const',
                                     'Size' => '8',
                                     'Type' => 'Const'
                                   },
                          '3701' => {
                                      'BaseType' => '2329',
                                      'Name' => 'struct lyext_substmt*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3707' => {
                                      'Header' => undef,
                                      'Line' => '40',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'dict',
                                                           'offset' => '0',
                                                           'type' => '10711'
                                                         },
                                                  '1' => {
                                                           'name' => 'models',
                                                           'offset' => '48',
                                                           'type' => '13376'
                                                         },
                                                  '2' => {
                                                           'name' => 'imp_clb',
                                                           'offset' => '96',
                                                           'type' => '9692'
                                                         },
                                                  '3' => {
                                                           'name' => 'imp_clb_data',
                                                           'offset' => '104',
                                                           'type' => '241'
                                                         },
                                                  '4' => {
                                                           'name' => 'data_clb',
                                                           'offset' => '112',
                                                           'type' => '9790'
                                                         },
                                                  '5' => {
                                                           'name' => 'data_clb_data',
                                                           'offset' => '120',
                                                           'type' => '241'
                                                         },
                                                  '6' => {
                                                           'name' => 'errlist_key',
                                                           'offset' => '128',
                                                           'type' => '693'
                                                         },
                                                  '7' => {
                                                           'name' => 'internal_module_count',
                                                           'offset' => '132',
                                                           'type' => '1532'
                                                         }
                                                },
                                      'Name' => 'struct ly_ctx',
                                      'PrivateABI' => 1,
                                      'Size' => '136',
                                      'Type' => 'Struct'
                                    },
                          '3825' => {
                                      'BaseType' => '3707',
                                      'Name' => 'struct ly_ctx const',
                                      'Size' => '136',
                                      'Type' => 'Const'
                                    },
                          '3830' => {
                                      'BaseType' => '3707',
                                      'Name' => 'struct ly_ctx*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3836' => {
                                      'BaseType' => '1532',
                                      'Name' => 'uint8_t[2]',
                                      'Size' => '2',
                                      'Type' => 'Array'
                                    },
                          '3852' => {
                                      'Header' => undef,
                                      'Line' => '1984',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'date',
                                                           'offset' => '0',
                                                           'type' => '8642'
                                                         },
                                                  '1' => {
                                                           'name' => 'ext_size',
                                                           'offset' => '11',
                                                           'type' => '1532'
                                                         },
                                                  '2' => {
                                                           'name' => 'ext',
                                                           'offset' => '16',
                                                           'type' => '2768'
                                                         },
                                                  '3' => {
                                                           'name' => 'dsc',
                                                           'offset' => '24',
                                                           'type' => '362'
                                                         },
                                                  '4' => {
                                                           'name' => 'ref',
                                                           'offset' => '32',
                                                           'type' => '362'
                                                         }
                                                },
                                      'Name' => 'struct lys_revision',
                                      'PrivateABI' => 1,
                                      'Size' => '40',
                                      'Type' => 'Struct'
                                    },
                          '3937' => {
                                      'BaseType' => '3852',
                                      'Name' => 'struct lys_revision*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3943' => {
                                      'Header' => undef,
                                      'Line' => '1959',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'module',
                                                           'offset' => '0',
                                                           'type' => '3352'
                                                         },
                                                  '1' => {
                                                           'name' => 'prefix',
                                                           'offset' => '8',
                                                           'type' => '362'
                                                         },
                                                  '2' => {
                                                           'name' => 'rev',
                                                           'offset' => '16',
                                                           'type' => '8642'
                                                         },
                                                  '3' => {
                                                           'name' => 'ext_size',
                                                           'offset' => '27',
                                                           'type' => '1532'
                                                         },
                                                  '4' => {
                                                           'name' => 'ext',
                                                           'offset' => '32',
                                                           'type' => '2768'
                                                         },
                                                  '5' => {
                                                           'name' => 'dsc',
                                                           'offset' => '40',
                                                           'type' => '362'
                                                         },
                                                  '6' => {
                                                           'name' => 'ref',
                                                           'offset' => '48',
                                                           'type' => '362'
                                                         }
                                                },
                                      'Name' => 'struct lys_import',
                                      'PrivateABI' => 1,
                                      'Size' => '56',
                                      'Type' => 'Struct'
                                    },
                          '397' => {
                                     'BaseType' => '81',
                                     'Header' => undef,
                                     'Line' => '216',
                                     'Name' => 'size_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '4056' => {
                                      'BaseType' => '3943',
                                      'Name' => 'struct lys_import*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4062' => {
                                      'Header' => undef,
                                      'Line' => '1972',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'submodule',
                                                           'offset' => '0',
                                                           'type' => '8658'
                                                         },
                                                  '1' => {
                                                           'name' => 'rev',
                                                           'offset' => '8',
                                                           'type' => '8642'
                                                         },
                                                  '2' => {
                                                           'name' => 'ext_size',
                                                           'offset' => '19',
                                                           'type' => '1532'
                                                         },
                                                  '3' => {
                                                           'name' => 'ext',
                                                           'offset' => '24',
                                                           'type' => '2768'
                                                         },
                                                  '4' => {
                                                           'name' => 'dsc',
                                                           'offset' => '32',
                                                           'type' => '362'
                                                         },
                                                  '5' => {
                                                           'name' => 'ref',
                                                           'offset' => '40',
                                                           'type' => '362'
                                                         }
                                                },
                                      'Name' => 'struct lys_include',
                                      'PrivateABI' => 1,
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '4161' => {
                                      'BaseType' => '4062',
                                      'Name' => 'struct lys_include*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4167' => {
                                      'Header' => undef,
                                      'Line' => '1995',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'name',
                                                           'offset' => '0',
                                                           'type' => '362'
                                                         },
                                                  '1' => {
                                                           'name' => 'dsc',
                                                           'offset' => '8',
                                                           'type' => '362'
                                                         },
                                                  '10' => {
                                                            'name' => 'module',
                                                            'offset' => '48',
                                                            'type' => '3352'
                                                          },
                                                  '11' => {
                                                            'name' => 'type',
                                                            'offset' => '56',
                                                            'type' => '7398'
                                                          },
                                                  '12' => {
                                                            'name' => 'dflt',
                                                            'offset' => '120',
                                                            'type' => '362'
                                                          },
                                                  '2' => {
                                                           'name' => 'ref',
                                                           'offset' => '16',
                                                           'type' => '362'
                                                         },
                                                  '3' => {
                                                           'name' => 'flags',
                                                           'offset' => '24',
                                                           'type' => '1549'
                                                         },
                                                  '4' => {
                                                           'name' => 'ext_size',
                                                           'offset' => '26',
                                                           'type' => '1532'
                                                         },
                                                  '5' => {
                                                           'name' => 'padding_iffsize',
                                                           'offset' => '27',
                                                           'type' => '1532'
                                                         },
                                                  '6' => {
                                                           'name' => 'has_union_leafref',
                                                           'offset' => '28',
                                                           'type' => '1532'
                                                         },
                                                  '7' => {
                                                           'name' => 'padding',
                                                           'offset' => '29',
                                                           'type' => '5910'
                                                         },
                                                  '8' => {
                                                           'name' => 'ext',
                                                           'offset' => '32',
                                                           'type' => '2768'
                                                         },
                                                  '9' => {
                                                           'name' => 'units',
                                                           'offset' => '40',
                                                           'type' => '362'
                                                         }
                                                },
                                      'Name' => 'struct lys_tpdf',
                                      'PrivateABI' => 1,
                                      'Size' => '128',
                                      'Type' => 'Struct'
                                    },
                          '4364' => {
                                      'BaseType' => '4167',
                                      'Name' => 'struct lys_tpdf*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4370' => {
                                      'Header' => undef,
                                      'Line' => '2080',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'name',
                                                           'offset' => '0',
                                                           'type' => '362'
                                                         },
                                                  '1' => {
                                                           'name' => 'dsc',
                                                           'offset' => '8',
                                                           'type' => '362'
                                                         },
                                                  '10' => {
                                                            'name' => 'module',
                                                            'offset' => '48',
                                                            'type' => '3352'
                                                          },
                                                  '11' => {
                                                            'name' => 'base',
                                                            'offset' => '56',
                                                            'type' => '6800'
                                                          },
                                                  '12' => {
                                                            'name' => 'der',
                                                            'offset' => '64',
                                                            'type' => '7852'
                                                          },
                                                  '2' => {
                                                           'name' => 'ref',
                                                           'offset' => '16',
                                                           'type' => '362'
                                                         },
                                                  '3' => {
                                                           'name' => 'flags',
                                                           'offset' => '24',
                                                           'type' => '1549'
                                                         },
                                                  '4' => {
                                                           'name' => 'ext_size',
                                                           'offset' => '26',
                                                           'type' => '1532'
                                                         },
                                                  '5' => {
                                                           'name' => 'iffeature_size',
                                                           'offset' => '27',
                                                           'type' => '1532'
                                                         },
                                                  '6' => {
                                                           'name' => 'padding',
                                                           'offset' => '28',
                                                           'type' => '5910'
                                                         },
                                                  '7' => {
                                                           'name' => 'base_size',
                                                           'offset' => '31',
                                                           'type' => '1532'
                                                         },
                                                  '8' => {
                                                           'name' => 'ext',
                                                           'offset' => '32',
                                                           'type' => '2768'
                                                         },
                                                  '9' => {
                                                           'name' => 'iffeature',
                                                           'offset' => '40',
                                                           'type' => '6455'
                                                         }
                                                },
                                      'Name' => 'struct lys_ident',
                                      'PrivateABI' => 1,
                                      'Size' => '72',
                                      'Type' => 'Struct'
                                    },
                          '45' => {
                                    'Name' => 'unsigned char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '4567' => {
                                      'BaseType' => '4370',
                                      'Name' => 'struct lys_ident*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4573' => {
                                      'Header' => undef,
                                      'Line' => '2029',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'name',
                                                           'offset' => '0',
                                                           'type' => '362'
                                                         },
                                                  '1' => {
                                                           'name' => 'dsc',
                                                           'offset' => '8',
                                                           'type' => '362'
                                                         },
                                                  '10' => {
                                                            'name' => 'depfeatures',
                                                            'offset' => '56',
                                                            'type' => '7852'
                                                          },
                                                  '2' => {
                                                           'name' => 'ref',
                                                           'offset' => '16',
                                                           'type' => '362'
                                                         },
                                                  '3' => {
                                                           'name' => 'flags',
                                                           'offset' => '24',
                                                           'type' => '1549'
                                                         },
                                                  '4' => {
                                                           'name' => 'ext_size',
                                                           'offset' => '26',
                                                           'type' => '1532'
                                                         },
                                                  '5' => {
                                                           'name' => 'iffeature_size',
                                                           'offset' => '27',
                                                           'type' => '1532'
                                                         },
                                                  '6' => {
                                                           'name' => 'padding',
                                                           'offset' => '28',
                                                           'type' => '7674'
                                                         },
                                                  '7' => {
                                                           'name' => 'ext',
                                                           'offset' => '32',
                                                           'type' => '2768'
                                                         },
                                                  '8' => {
                                                           'name' => 'iffeature',
                                                           'offset' => '40',
                                                           'type' => '6455'
                                                         },
                                                  '9' => {
                                                           'name' => 'module',
                                                           'offset' => '48',
                                                           'type' => '3352'
                                                         }
                                                },
                                      'Name' => 'struct lys_feature',
                                      'PrivateABI' => 1,
                                      'Size' => '64',
                                      'Type' => 'Struct'
                                    },
                          '46108' => {
                                       'Name' => 'void(*)(struct lys_node const*, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '14680'
                                                           },
                                                    '1' => {
                                                             'type' => '241'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '4742' => {
                                      'BaseType' => '4573',
                                      'Name' => 'struct lys_feature*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4748' => {
                                      'Header' => undef,
                                      'Line' => '1823',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'target_name',
                                                           'offset' => '0',
                                                           'type' => '362'
                                                         },
                                                  '1' => {
                                                           'name' => 'dsc',
                                                           'offset' => '8',
                                                           'type' => '362'
                                                         },
                                                  '10' => {
                                                            'name' => 'nodetype',
                                                            'offset' => '56',
                                                            'type' => '1768'
                                                          },
                                                  '11' => {
                                                            'name' => 'parent',
                                                            'offset' => '64',
                                                            'type' => '5384'
                                                          },
                                                  '12' => {
                                                            'name' => 'child',
                                                            'offset' => '72',
                                                            'type' => '5384'
                                                          },
                                                  '13' => {
                                                            'name' => 'when',
                                                            'offset' => '80',
                                                            'type' => '7789'
                                                          },
                                                  '14' => {
                                                            'name' => 'target',
                                                            'offset' => '88',
                                                            'type' => '5384'
                                                          },
                                                  '15' => {
                                                            'name' => 'priv',
                                                            'offset' => '96',
                                                            'type' => '241'
                                                          },
                                                  '2' => {
                                                           'name' => 'ref',
                                                           'offset' => '16',
                                                           'type' => '362'
                                                         },
                                                  '3' => {
                                                           'name' => 'flags',
                                                           'offset' => '24',
                                                           'type' => '1549'
                                                         },
                                                  '4' => {
                                                           'name' => 'ext_size',
                                                           'offset' => '26',
                                                           'type' => '1532'
                                                         },
                                                  '5' => {
                                                           'name' => 'iffeature_size',
                                                           'offset' => '27',
                                                           'type' => '1532'
                                                         },
                                                  '6' => {
                                                           'name' => 'padding',
                                                           'offset' => '28',
                                                           'type' => '7674'
                                                         },
                                                  '7' => {
                                                           'name' => 'ext',
                                                           'offset' => '32',
                                                           'type' => '2768'
                                                         },
                                                  '8' => {
                                                           'name' => 'iffeature',
                                                           'offset' => '40',
                                                           'type' => '6455'
                                                         },
                                                  '9' => {
                                                           'name' => 'module',
                                                           'offset' => '48',
                                                           'type' => '3352'
                                                         }
                                                },
                                      'Name' => 'struct lys_node_augment',
                                      'PrivateABI' => 1,
                                      'Size' => '104',
                                      'Type' => 'Struct'
                                    },
                          '4987' => {
                                      'BaseType' => '4748',
                                      'Name' => 'struct lys_node_augment*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4993' => {
                                      'Header' => undef,
                                      'Line' => '1943',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'target_name',
                                                           'offset' => '0',
                                                           'type' => '362'
                                                         },
                                                  '1' => {
                                                           'name' => 'dsc',
                                                           'offset' => '8',
                                                           'type' => '362'
                                                         },
                                                  '2' => {
                                                           'name' => 'ref',
                                                           'offset' => '16',
                                                           'type' => '362'
                                                         },
                                                  '3' => {
                                                           'name' => 'orig_node',
                                                           'offset' => '24',
                                                           'type' => '5384'
                                                         },
                                                  '4' => {
                                                           'name' => 'deviate_size',
                                                           'offset' => '32',
                                                           'type' => '1532'
                                                         },
                                                  '5' => {
                                                           'name' => 'ext_size',
                                                           'offset' => '33',
                                                           'type' => '1532'
                                                         },
                                                  '6' => {
                                                           'name' => 'deviate',
                                                           'offset' => '40',
                                                           'type' => '8636'
                                                         },
                                                  '7' => {
                                                           'name' => 'ext',
                                                           'offset' => '48',
                                                           'type' => '2768'
                                                         }
                                                },
                                      'Name' => 'struct lys_deviation',
                                      'PrivateABI' => 1,
                                      'Size' => '56',
                                      'Type' => 'Struct'
                                    },
                          '5120' => {
                                      'BaseType' => '4993',
                                      'Name' => 'struct lys_deviation*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5126' => {
                                      'Header' => undef,
                                      'Line' => '1209',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'name',
                                                           'offset' => '0',
                                                           'type' => '362'
                                                         },
                                                  '1' => {
                                                           'name' => 'dsc',
                                                           'offset' => '8',
                                                           'type' => '362'
                                                         },
                                                  '10' => {
                                                            'name' => 'nodetype',
                                                            'offset' => '56',
                                                            'type' => '1768'
                                                          },
                                                  '11' => {
                                                            'name' => 'parent',
                                                            'offset' => '64',
                                                            'type' => '5384'
                                                          },
                                                  '12' => {
                                                            'name' => 'child',
                                                            'offset' => '72',
                                                            'type' => '5384'
                                                          },
                                                  '13' => {
                                                            'name' => 'next',
                                                            'offset' => '80',
                                                            'type' => '5384'
                                                          },
                                                  '14' => {
                                                            'name' => 'prev',
                                                            'offset' => '88',
                                                            'type' => '5384'
                                                          },
                                                  '15' => {
                                                            'name' => 'priv',
                                                            'offset' => '96',
                                                            'type' => '241'
                                                          },
                                                  '16' => {
                                                            'name' => 'hash',
                                                            'offset' => '104',
                                                            'type' => '7674'
                                                          },
                                                  '2' => {
                                                           'name' => 'ref',
                                                           'offset' => '16',
                                                           'type' => '362'
                                                         },
                                                  '3' => {
                                                           'name' => 'flags',
                                                           'offset' => '24',
                                                           'type' => '1549'
                                                         },
                                                  '4' => {
                                                           'name' => 'ext_size',
                                                           'offset' => '26',
                                                           'type' => '1532'
                                                         },
                                                  '5' => {
                                                           'name' => 'iffeature_size',
                                                           'offset' => '27',
                                                           'type' => '1532'
                                                         },
                                                  '6' => {
                                                           'name' => 'padding',
                                                           'offset' => '28',
                                                           'type' => '7674'
                                                         },
                                                  '7' => {
                                                           'name' => 'ext',
                                                           'offset' => '32',
                                                           'type' => '2768'
                                                         },
                                                  '8' => {
                                                           'name' => 'iffeature',
                                                           'offset' => '40',
                                                           'type' => '6455'
                                                         },
                                                  '9' => {
                                                           'name' => 'module',
                                                           'offset' => '48',
                                                           'type' => '3352'
                                                         }
                                                },
                                      'Name' => 'struct lys_node',
                                      'PrivateABI' => 1,
                                      'Size' => '112',
                                      'Type' => 'Struct'
                                    },
                          '5379' => {
                                      'BaseType' => '5126',
                                      'Name' => 'struct lys_node const',
                                      'Size' => '112',
                                      'Type' => 'Const'
                                    },
                          '5384' => {
                                      'BaseType' => '5126',
                                      'Name' => 'struct lys_node*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5390' => {
                                      'Header' => undef,
                                      'Line' => '729',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ctx',
                                                           'offset' => '0',
                                                           'type' => '3830'
                                                         },
                                                  '1' => {
                                                           'name' => 'name',
                                                           'offset' => '8',
                                                           'type' => '362'
                                                         },
                                                  '10' => {
                                                            'bitfield' => '2',
                                                            'name' => 'deviated',
                                                            'offset' => '64',
                                                            'type' => '1532'
                                                          },
                                                  '11' => {
                                                            'bitfield' => '1',
                                                            'name' => 'disabled',
                                                            'offset' => '64',
                                                            'type' => '1532'
                                                          },
                                                  '12' => {
                                                            'bitfield' => '1',
                                                            'name' => 'implemented',
                                                            'offset' => '64',
                                                            'type' => '1532'
                                                          },
                                                  '13' => {
                                                            'name' => 'padding',
                                                            'offset' => '65',
                                                            'type' => '5910'
                                                          },
                                                  '14' => {
                                                            'name' => 'rev_size',
                                                            'offset' => '68',
                                                            'type' => '1532'
                                                          },
                                                  '15' => {
                                                            'name' => 'imp_size',
                                                            'offset' => '69',
                                                            'type' => '1532'
                                                          },
                                                  '16' => {
                                                            'name' => 'inc_size',
                                                            'offset' => '70',
                                                            'type' => '1532'
                                                          },
                                                  '17' => {
                                                            'name' => 'ident_size',
                                                            'offset' => '72',
                                                            'type' => '1549'
                                                          },
                                                  '18' => {
                                                            'name' => 'tpdf_size',
                                                            'offset' => '74',
                                                            'type' => '1549'
                                                          },
                                                  '19' => {
                                                            'name' => 'features_size',
                                                            'offset' => '76',
                                                            'type' => '1532'
                                                          },
                                                  '2' => {
                                                           'name' => 'prefix',
                                                           'offset' => '16',
                                                           'type' => '362'
                                                         },
                                                  '20' => {
                                                            'name' => 'augment_size',
                                                            'offset' => '77',
                                                            'type' => '1532'
                                                          },
                                                  '21' => {
                                                            'name' => 'deviation_size',
                                                            'offset' => '78',
                                                            'type' => '1532'
                                                          },
                                                  '22' => {
                                                            'name' => 'extensions_size',
                                                            'offset' => '79',
                                                            'type' => '1532'
                                                          },
                                                  '23' => {
                                                            'name' => 'ext_size',
                                                            'offset' => '80',
                                                            'type' => '1532'
                                                          },
                                                  '24' => {
                                                            'name' => 'rev',
                                                            'offset' => '88',
                                                            'type' => '3937'
                                                          },
                                                  '25' => {
                                                            'name' => 'imp',
                                                            'offset' => '96',
                                                            'type' => '4056'
                                                          },
                                                  '26' => {
                                                            'name' => 'inc',
                                                            'offset' => '104',
                                                            'type' => '4161'
                                                          },
                                                  '27' => {
                                                            'name' => 'tpdf',
                                                            'offset' => '112',
                                                            'type' => '4364'
                                                          },
                                                  '28' => {
                                                            'name' => 'ident',
                                                            'offset' => '120',
                                                            'type' => '4567'
                                                          },
                                                  '29' => {
                                                            'name' => 'features',
                                                            'offset' => '128',
                                                            'type' => '4742'
                                                          },
                                                  '3' => {
                                                           'name' => 'dsc',
                                                           'offset' => '24',
                                                           'type' => '362'
                                                         },
                                                  '30' => {
                                                            'name' => 'augment',
                                                            'offset' => '136',
                                                            'type' => '4987'
                                                          },
                                                  '31' => {
                                                            'name' => 'deviation',
                                                            'offset' => '144',
                                                            'type' => '5120'
                                                          },
                                                  '32' => {
                                                            'name' => 'extensions',
                                                            'offset' => '152',
                                                            'type' => '3456'
                                                          },
                                                  '33' => {
                                                            'name' => 'ext',
                                                            'offset' => '160',
                                                            'type' => '2768'
                                                          },
                                                  '34' => {
                                                            'name' => 'belongsto',
                                                            'offset' => '168',
                                                            'type' => '3352'
                                                          },
                                                  '4' => {
                                                           'name' => 'ref',
                                                           'offset' => '32',
                                                           'type' => '362'
                                                         },
                                                  '5' => {
                                                           'name' => 'org',
                                                           'offset' => '40',
                                                           'type' => '362'
                                                         },
                                                  '6' => {
                                                           'name' => 'contact',
                                                           'offset' => '48',
                                                           'type' => '362'
                                                         },
                                                  '7' => {
                                                           'name' => 'filepath',
                                                           'offset' => '56',
                                                           'type' => '362'
                                                         },
                                                  '8' => {
                                                           'bitfield' => '1',
                                                           'name' => 'type',
                                                           'offset' => '64',
                                                           'type' => '1532'
                                                         },
                                                  '9' => {
                                                           'bitfield' => '3',
                                                           'name' => 'version',
                                                           'offset' => '64',
                                                           'type' => '1532'
                                                         }
                                                },
                                      'Name' => 'struct lys_submodule',
                                      'PrivateABI' => 1,
                                      'Size' => '176',
                                      'Type' => 'Struct'
                                    },
                          '54242' => {
                                       'BaseType' => '35491',
                                       'Name' => 'struct lys_submodule const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '55272' => {
                                       'BaseType' => '368',
                                       'Name' => 'char const*const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '57' => {
                                    'Name' => 'unsigned short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '5910' => {
                                      'BaseType' => '1532',
                                      'Name' => 'uint8_t[3]',
                                      'Size' => '3',
                                      'Type' => 'Array'
                                    },
                          '6081' => {
                                      'Header' => undef,
                                      'Line' => '812',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'length',
                                                           'offset' => '0',
                                                           'type' => '6237'
                                                         }
                                                },
                                      'Name' => 'struct lys_type_info_binary',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '6110' => {
                                      'Header' => undef,
                                      'Line' => '2050',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'expr',
                                                           'offset' => '0',
                                                           'type' => '362'
                                                         },
                                                  '1' => {
                                                           'name' => 'dsc',
                                                           'offset' => '8',
                                                           'type' => '362'
                                                         },
                                                  '2' => {
                                                           'name' => 'ref',
                                                           'offset' => '16',
                                                           'type' => '362'
                                                         },
                                                  '3' => {
                                                           'name' => 'eapptag',
                                                           'offset' => '24',
                                                           'type' => '362'
                                                         },
                                                  '4' => {
                                                           'name' => 'emsg',
                                                           'offset' => '32',
                                                           'type' => '362'
                                                         },
                                                  '5' => {
                                                           'name' => 'ext',
                                                           'offset' => '40',
                                                           'type' => '2768'
                                                         },
                                                  '6' => {
                                                           'name' => 'ext_size',
                                                           'offset' => '48',
                                                           'type' => '1532'
                                                         },
                                                  '7' => {
                                                           'name' => 'flags',
                                                           'offset' => '50',
                                                           'type' => '1549'
                                                         }
                                                },
                                      'Name' => 'struct lys_restr',
                                      'PrivateABI' => 1,
                                      'Size' => '56',
                                      'Type' => 'Struct'
                                    },
                          '6237' => {
                                      'BaseType' => '6110',
                                      'Name' => 'struct lys_restr*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6243' => {
                                      'Header' => undef,
                                      'Line' => '820',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'name',
                                                           'offset' => '0',
                                                           'type' => '362'
                                                         },
                                                  '1' => {
                                                           'name' => 'dsc',
                                                           'offset' => '8',
                                                           'type' => '362'
                                                         },
                                                  '2' => {
                                                           'name' => 'ref',
                                                           'offset' => '16',
                                                           'type' => '362'
                                                         },
                                                  '3' => {
                                                           'name' => 'flags',
                                                           'offset' => '24',
                                                           'type' => '1549'
                                                         },
                                                  '4' => {
                                                           'name' => 'ext_size',
                                                           'offset' => '26',
                                                           'type' => '1532'
                                                         },
                                                  '5' => {
                                                           'name' => 'iffeature_size',
                                                           'offset' => '27',
                                                           'type' => '1532'
                                                         },
                                                  '6' => {
                                                           'name' => 'pos',
                                                           'offset' => '28',
                                                           'type' => '1561'
                                                         },
                                                  '7' => {
                                                           'name' => 'ext',
                                                           'offset' => '32',
                                                           'type' => '2768'
                                                         },
                                                  '8' => {
                                                           'name' => 'iffeature',
                                                           'offset' => '40',
                                                           'type' => '6455'
                                                         }
                                                },
                                      'Name' => 'struct lys_type_bit',
                                      'PrivateABI' => 1,
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '6384' => {
                                      'Header' => undef,
                                      'Line' => '1070',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'expr',
                                                           'offset' => '0',
                                                           'type' => '7662'
                                                         },
                                                  '1' => {
                                                           'name' => 'ext_size',
                                                           'offset' => '8',
                                                           'type' => '1532'
                                                         },
                                                  '2' => {
                                                           'name' => 'features',
                                                           'offset' => '16',
                                                           'type' => '7668'
                                                         },
                                                  '3' => {
                                                           'name' => 'ext',
                                                           'offset' => '24',
                                                           'type' => '2768'
                                                         }
                                                },
                                      'Name' => 'struct lys_iffeature',
                                      'PrivateABI' => 1,
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '6455' => {
                                      'BaseType' => '6384',
                                      'Name' => 'struct lys_iffeature*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6461' => {
                                      'Header' => undef,
                                      'Line' => '839',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'bit',
                                                           'offset' => '0',
                                                           'type' => '6504'
                                                         },
                                                  '1' => {
                                                           'name' => 'count',
                                                           'offset' => '8',
                                                           'type' => '69'
                                                         }
                                                },
                                      'Name' => 'struct lys_type_info_bits',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '6504' => {
                                      'BaseType' => '6243',
                                      'Name' => 'struct lys_type_bit*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6510' => {
                                      'Header' => undef,
                                      'Line' => '847',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'range',
                                                           'offset' => '0',
                                                           'type' => '6237'
                                                         },
                                                  '1' => {
                                                           'name' => 'dig',
                                                           'offset' => '8',
                                                           'type' => '1532'
                                                         },
                                                  '2' => {
                                                           'name' => 'div',
                                                           'offset' => '16',
                                                           'type' => '1573'
                                                         }
                                                },
                                      'Name' => 'struct lys_type_info_dec64',
                                      'PrivateABI' => 1,
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '6567' => {
                                      'Header' => undef,
                                      'Line' => '860',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'name',
                                                           'offset' => '0',
                                                           'type' => '362'
                                                         },
                                                  '1' => {
                                                           'name' => 'dsc',
                                                           'offset' => '8',
                                                           'type' => '362'
                                                         },
                                                  '2' => {
                                                           'name' => 'ref',
                                                           'offset' => '16',
                                                           'type' => '362'
                                                         },
                                                  '3' => {
                                                           'name' => 'flags',
                                                           'offset' => '24',
                                                           'type' => '1549'
                                                         },
                                                  '4' => {
                                                           'name' => 'ext_size',
                                                           'offset' => '26',
                                                           'type' => '1532'
                                                         },
                                                  '5' => {
                                                           'name' => 'iffeature_size',
                                                           'offset' => '27',
                                                           'type' => '1532'
                                                         },
                                                  '6' => {
                                                           'name' => 'value',
                                                           'offset' => '28',
                                                           'type' => '1421'
                                                         },
                                                  '7' => {
                                                           'name' => 'ext',
                                                           'offset' => '32',
                                                           'type' => '2768'
                                                         },
                                                  '8' => {
                                                           'name' => 'iffeature',
                                                           'offset' => '40',
                                                           'type' => '6455'
                                                         }
                                                },
                                      'Name' => 'struct lys_type_enum',
                                      'PrivateABI' => 1,
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '6708' => {
                                      'Header' => undef,
                                      'Line' => '879',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'enm',
                                                           'offset' => '0',
                                                           'type' => '6751'
                                                         },
                                                  '1' => {
                                                           'name' => 'count',
                                                           'offset' => '8',
                                                           'type' => '69'
                                                         }
                                                },
                                      'Name' => 'struct lys_type_info_enums',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '6751' => {
                                      'BaseType' => '6567',
                                      'Name' => 'struct lys_type_enum*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6757' => {
                                      'Header' => undef,
                                      'Line' => '887',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ref',
                                                           'offset' => '0',
                                                           'type' => '6800'
                                                         },
                                                  '1' => {
                                                           'name' => 'count',
                                                           'offset' => '8',
                                                           'type' => '69'
                                                         }
                                                },
                                      'Name' => 'struct lys_type_info_ident',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '6800' => {
                                      'BaseType' => '4567',
                                      'Name' => 'struct lys_ident**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6806' => {
                                      'Header' => undef,
                                      'Line' => '895',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'req',
                                                           'offset' => '0',
                                                           'type' => '1397'
                                                         }
                                                },
                                      'Name' => 'struct lys_type_info_inst',
                                      'PrivateABI' => 1,
                                      'Size' => '1',
                                      'Type' => 'Struct'
                                    },
                          '6835' => {
                                      'Header' => undef,
                                      'Line' => '906',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'range',
                                                           'offset' => '0',
                                                           'type' => '6237'
                                                         }
                                                },
                                      'Name' => 'struct lys_type_info_num',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '6864' => {
                                      'Header' => undef,
                                      'Line' => '914',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'path',
                                                           'offset' => '0',
                                                           'type' => '362'
                                                         },
                                                  '1' => {
                                                           'name' => 'target',
                                                           'offset' => '8',
                                                           'type' => '7258'
                                                         },
                                                  '2' => {
                                                           'name' => 'req',
                                                           'offset' => '16',
                                                           'type' => '1397'
                                                         }
                                                },
                                      'Name' => 'struct lys_type_info_lref',
                                      'PrivateABI' => 1,
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '69' => {
                                    'Name' => 'unsigned int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '6921' => {
                                      'Header' => undef,
                                      'Line' => '1345',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'name',
                                                           'offset' => '0',
                                                           'type' => '362'
                                                         },
                                                  '1' => {
                                                           'name' => 'dsc',
                                                           'offset' => '8',
                                                           'type' => '362'
                                                         },
                                                  '10' => {
                                                            'name' => 'module',
                                                            'offset' => '48',
                                                            'type' => '3352'
                                                          },
                                                  '11' => {
                                                            'name' => 'nodetype',
                                                            'offset' => '56',
                                                            'type' => '1768'
                                                          },
                                                  '12' => {
                                                            'name' => 'parent',
                                                            'offset' => '64',
                                                            'type' => '5384'
                                                          },
                                                  '13' => {
                                                            'name' => 'child',
                                                            'offset' => '72',
                                                            'type' => '241'
                                                          },
                                                  '14' => {
                                                            'name' => 'next',
                                                            'offset' => '80',
                                                            'type' => '5384'
                                                          },
                                                  '15' => {
                                                            'name' => 'prev',
                                                            'offset' => '88',
                                                            'type' => '5384'
                                                          },
                                                  '16' => {
                                                            'name' => 'priv',
                                                            'offset' => '96',
                                                            'type' => '241'
                                                          },
                                                  '17' => {
                                                            'name' => 'hash',
                                                            'offset' => '104',
                                                            'type' => '7674'
                                                          },
                                                  '18' => {
                                                            'name' => 'when',
                                                            'offset' => '112',
                                                            'type' => '7789'
                                                          },
                                                  '19' => {
                                                            'name' => 'must',
                                                            'offset' => '120',
                                                            'type' => '6237'
                                                          },
                                                  '2' => {
                                                           'name' => 'ref',
                                                           'offset' => '16',
                                                           'type' => '362'
                                                         },
                                                  '20' => {
                                                            'name' => 'type',
                                                            'offset' => '128',
                                                            'type' => '7398'
                                                          },
                                                  '21' => {
                                                            'name' => 'units',
                                                            'offset' => '192',
                                                            'type' => '362'
                                                          },
                                                  '22' => {
                                                            'name' => 'dflt',
                                                            'offset' => '200',
                                                            'type' => '362'
                                                          },
                                                  '3' => {
                                                           'name' => 'flags',
                                                           'offset' => '24',
                                                           'type' => '1549'
                                                         },
                                                  '4' => {
                                                           'name' => 'ext_size',
                                                           'offset' => '26',
                                                           'type' => '1532'
                                                         },
                                                  '5' => {
                                                           'name' => 'iffeature_size',
                                                           'offset' => '27',
                                                           'type' => '1532'
                                                         },
                                                  '6' => {
                                                           'name' => 'padding',
                                                           'offset' => '28',
                                                           'type' => '5910'
                                                         },
                                                  '7' => {
                                                           'name' => 'must_size',
                                                           'offset' => '31',
                                                           'type' => '1532'
                                                         },
                                                  '8' => {
                                                           'name' => 'ext',
                                                           'offset' => '32',
                                                           'type' => '2768'
                                                         },
                                                  '9' => {
                                                           'name' => 'iffeature',
                                                           'offset' => '40',
                                                           'type' => '6455'
                                                         }
                                                },
                                      'Name' => 'struct lys_node_leaf',
                                      'PrivateABI' => 1,
                                      'Size' => '208',
                                      'Type' => 'Struct'
                                    },
                          '693' => {
                                     'BaseType' => '69',
                                     'Header' => undef,
                                     'Line' => '49',
                                     'Name' => 'pthread_key_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '707553' => {
                                        'BaseType' => '7795',
                                        'Name' => 'struct ly_set const',
                                        'Size' => '16',
                                        'Type' => 'Const'
                                      },
                          '723671' => {
                                        'BaseType' => '707553',
                                        'Name' => 'struct ly_set const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '7258' => {
                                      'BaseType' => '6921',
                                      'Name' => 'struct lys_node_leaf*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7264' => {
                                      'Header' => undef,
                                      'Line' => '927',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'length',
                                                           'offset' => '0',
                                                           'type' => '6237'
                                                         },
                                                  '1' => {
                                                           'name' => 'patterns',
                                                           'offset' => '8',
                                                           'type' => '6237'
                                                         },
                                                  '2' => {
                                                           'name' => 'pat_count',
                                                           'offset' => '16',
                                                           'type' => '69'
                                                         },
                                                  '3' => {
                                                           'name' => 'patterns_pcre',
                                                           'offset' => '24',
                                                           'type' => '7335'
                                                         }
                                                },
                                      'Name' => 'struct lys_type_info_str',
                                      'PrivateABI' => 1,
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '7335' => {
                                      'BaseType' => '241',
                                      'Name' => 'void**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7341' => {
                                      'Header' => undef,
                                      'Line' => '947',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'types',
                                                           'offset' => '0',
                                                           'type' => '7511'
                                                         },
                                                  '1' => {
                                                           'name' => 'count',
                                                           'offset' => '8',
                                                           'type' => '69'
                                                         },
                                                  '2' => {
                                                           'name' => 'has_ptr_type',
                                                           'offset' => '12',
                                                           'type' => '162'
                                                         }
                                                },
                                      'Name' => 'struct lys_type_info_union',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '7398' => {
                                      'Header' => undef,
                                      'Line' => '973',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'base',
                                                           'offset' => '0',
                                                           'type' => '6068'
                                                         },
                                                  '1' => {
                                                           'name' => 'value_flags',
                                                           'offset' => '4',
                                                           'type' => '1532'
                                                         },
                                                  '2' => {
                                                           'name' => 'ext_size',
                                                           'offset' => '5',
                                                           'type' => '1532'
                                                         },
                                                  '3' => {
                                                           'name' => 'ext',
                                                           'offset' => '8',
                                                           'type' => '2768'
                                                         },
                                                  '4' => {
                                                           'name' => 'der',
                                                           'offset' => '16',
                                                           'type' => '4364'
                                                         },
                                                  '5' => {
                                                           'name' => 'parent',
                                                           'offset' => '24',
                                                           'type' => '4364'
                                                         },
                                                  '6' => {
                                                           'name' => 'info',
                                                           'offset' => '32',
                                                           'type' => '7517'
                                                         }
                                                },
                                      'Name' => 'struct lys_type',
                                      'PrivateABI' => 1,
                                      'Size' => '64',
                                      'Type' => 'Struct'
                                    },
                          '74864' => {
                                       'Name' => 'void(*)(, char const*, char const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '71354'
                                                           },
                                                    '1' => {
                                                             'type' => '362'
                                                           },
                                                    '2' => {
                                                             'type' => '362'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '7511' => {
                                      'BaseType' => '7398',
                                      'Name' => 'struct lys_type*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7517' => {
                                      'Header' => undef,
                                      'Line' => '957',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'binary',
                                                           'offset' => '0',
                                                           'type' => '6081'
                                                         },
                                                  '1' => {
                                                           'name' => 'bits',
                                                           'offset' => '0',
                                                           'type' => '6461'
                                                         },
                                                  '2' => {
                                                           'name' => 'dec64',
                                                           'offset' => '0',
                                                           'type' => '6510'
                                                         },
                                                  '3' => {
                                                           'name' => 'enums',
                                                           'offset' => '0',
                                                           'type' => '6708'
                                                         },
                                                  '4' => {
                                                           'name' => 'ident',
                                                           'offset' => '0',
                                                           'type' => '6757'
                                                         },
                                                  '5' => {
                                                           'name' => 'inst',
                                                           'offset' => '0',
                                                           'type' => '6806'
                                                         },
                                                  '6' => {
                                                           'name' => 'num',
                                                           'offset' => '0',
                                                           'type' => '6835'
                                                         },
                                                  '7' => {
                                                           'name' => 'lref',
                                                           'offset' => '0',
                                                           'type' => '6864'
                                                         },
                                                  '8' => {
                                                           'name' => 'str',
                                                           'offset' => '0',
                                                           'type' => '7264'
                                                         },
                                                  '9' => {
                                                           'name' => 'uni',
                                                           'offset' => '0',
                                                           'type' => '7341'
                                                         }
                                                },
                                      'Name' => 'union lys_type_info',
                                      'PrivateABI' => 1,
                                      'Size' => '32',
                                      'Type' => 'Union'
                                    },
                          '7662' => {
                                      'BaseType' => '1532',
                                      'Name' => 'uint8_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7668' => {
                                      'BaseType' => '4742',
                                      'Name' => 'struct lys_feature**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7674' => {
                                      'BaseType' => '1532',
                                      'Name' => 'uint8_t[4]',
                                      'Size' => '4',
                                      'Type' => 'Array'
                                    },
                          '7690' => {
                                      'Header' => undef,
                                      'Line' => '2066',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'cond',
                                                           'offset' => '0',
                                                           'type' => '362'
                                                         },
                                                  '1' => {
                                                           'name' => 'dsc',
                                                           'offset' => '8',
                                                           'type' => '362'
                                                         },
                                                  '2' => {
                                                           'name' => 'ref',
                                                           'offset' => '16',
                                                           'type' => '362'
                                                         },
                                                  '3' => {
                                                           'name' => 'ext',
                                                           'offset' => '24',
                                                           'type' => '2768'
                                                         },
                                                  '4' => {
                                                           'name' => 'ext_size',
                                                           'offset' => '32',
                                                           'type' => '1532'
                                                         },
                                                  '5' => {
                                                           'name' => 'flags',
                                                           'offset' => '34',
                                                           'type' => '1549'
                                                         }
                                                },
                                      'Name' => 'struct lys_when',
                                      'PrivateABI' => 1,
                                      'Size' => '40',
                                      'Type' => 'Struct'
                                    },
                          '7789' => {
                                      'BaseType' => '7690',
                                      'Name' => 'struct lys_when*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7795' => {
                                      'Header' => 'libyang.h',
                                      'Line' => '1708',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'size',
                                                           'offset' => '0',
                                                           'type' => '69'
                                                         },
                                                  '1' => {
                                                           'name' => 'number',
                                                           'offset' => '4',
                                                           'type' => '69'
                                                         },
                                                  '2' => {
                                                           'name' => 'set',
                                                           'offset' => '8',
                                                           'type' => '9850'
                                                         }
                                                },
                                      'Name' => 'struct ly_set',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '7852' => {
                                      'BaseType' => '7795',
                                      'Name' => 'struct ly_set*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7858' => {
                                      'BaseType' => '362',
                                      'Name' => 'char const**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '81' => {
                                    'Name' => 'unsigned long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '8277' => {
                                      'Header' => undef,
                                      'Line' => '2020',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'expr',
                                                           'offset' => '0',
                                                           'type' => '7858'
                                                         },
                                                  '1' => {
                                                           'name' => 'expr_size',
                                                           'offset' => '8',
                                                           'type' => '1532'
                                                         },
                                                  '2' => {
                                                           'name' => 'trg_type',
                                                           'offset' => '9',
                                                           'type' => '1532'
                                                         }
                                                },
                                      'Name' => 'struct lys_unique',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '8334' => {
                                      'BaseType' => '8277',
                                      'Name' => 'struct lys_unique*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '8340' => {
                                      'Header' => undef,
                                      'Line' => '1906',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'LY_DEVIATE_NO',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'LY_DEVIATE_ADD',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'LY_DEVIATE_RPL',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'LY_DEVIATE_DEL',
                                                           'value' => '3'
                                                         }
                                                },
                                      'Name' => 'enum lys_deviate_type',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '8384' => {
                                      'BaseType' => '8340',
                                      'Header' => undef,
                                      'Line' => '1911',
                                      'Name' => 'LYS_DEVIATE_TYPE',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '8397' => {
                                      'Header' => undef,
                                      'Line' => '1916',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'mod',
                                                           'offset' => '0',
                                                           'type' => '8384'
                                                         },
                                                  '1' => {
                                                           'name' => 'flags',
                                                           'offset' => '4',
                                                           'type' => '1532'
                                                         },
                                                  '10' => {
                                                            'name' => 'must',
                                                            'offset' => '24',
                                                            'type' => '6237'
                                                          },
                                                  '11' => {
                                                            'name' => 'unique',
                                                            'offset' => '32',
                                                            'type' => '8334'
                                                          },
                                                  '12' => {
                                                            'name' => 'type',
                                                            'offset' => '40',
                                                            'type' => '7511'
                                                          },
                                                  '13' => {
                                                            'name' => 'units',
                                                            'offset' => '48',
                                                            'type' => '362'
                                                          },
                                                  '14' => {
                                                            'name' => 'dflt',
                                                            'offset' => '56',
                                                            'type' => '7858'
                                                          },
                                                  '15' => {
                                                            'name' => 'ext',
                                                            'offset' => '64',
                                                            'type' => '2768'
                                                          },
                                                  '2' => {
                                                           'name' => 'dflt_size',
                                                           'offset' => '5',
                                                           'type' => '1532'
                                                         },
                                                  '3' => {
                                                           'name' => 'ext_size',
                                                           'offset' => '6',
                                                           'type' => '1532'
                                                         },
                                                  '4' => {
                                                           'name' => 'min_set',
                                                           'offset' => '7',
                                                           'type' => '1532'
                                                         },
                                                  '5' => {
                                                           'name' => 'max_set',
                                                           'offset' => '8',
                                                           'type' => '1532'
                                                         },
                                                  '6' => {
                                                           'name' => 'must_size',
                                                           'offset' => '9',
                                                           'type' => '1532'
                                                         },
                                                  '7' => {
                                                           'name' => 'unique_size',
                                                           'offset' => '10',
                                                           'type' => '1532'
                                                         },
                                                  '8' => {
                                                           'name' => 'min',
                                                           'offset' => '12',
                                                           'type' => '1561'
                                                         },
                                                  '9' => {
                                                           'name' => 'max',
                                                           'offset' => '16',
                                                           'type' => '1561'
                                                         }
                                                },
                                      'Name' => 'struct lys_deviate',
                                      'PrivateABI' => 1,
                                      'Size' => '72',
                                      'Type' => 'Struct'
                                    },
                          '8636' => {
                                      'BaseType' => '8397',
                                      'Name' => 'struct lys_deviate*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '8642' => {
                                      'BaseType' => '249',
                                      'Name' => 'char[11]',
                                      'Size' => '11',
                                      'Type' => 'Array'
                                    },
                          '8658' => {
                                      'BaseType' => '5390',
                                      'Name' => 'struct lys_submodule*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '8664' => {
                                      'Header' => undef,
                                      'Line' => '45',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'LYXML_ATTR_STD',
                                                           'value' => '1'
                                                         },
                                                  '1' => {
                                                           'name' => 'LYXML_ATTR_NS',
                                                           'value' => '2'
                                                         },
                                                  '2' => {
                                                           'name' => 'LYXML_ATTR_STD_UNRES',
                                                           'value' => '3'
                                                         }
                                                },
                                      'Name' => 'enum lyxml_attr_type',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '8701' => {
                                      'BaseType' => '8664',
                                      'Header' => undef,
                                      'Line' => '49',
                                      'Name' => 'LYXML_ATTR_TYPE',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '8713' => {
                                      'Header' => undef,
                                      'Line' => '58',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'type',
                                                           'offset' => '0',
                                                           'type' => '8701'
                                                         },
                                                  '1' => {
                                                           'name' => 'next',
                                                           'offset' => '8',
                                                           'type' => '8797'
                                                         },
                                                  '2' => {
                                                           'name' => 'parent',
                                                           'offset' => '16',
                                                           'type' => '8933'
                                                         },
                                                  '3' => {
                                                           'name' => 'prefix',
                                                           'offset' => '24',
                                                           'type' => '362'
                                                         },
                                                  '4' => {
                                                           'name' => 'value',
                                                           'offset' => '32',
                                                           'type' => '362'
                                                         }
                                                },
                                      'Name' => 'struct lyxml_ns',
                                      'PrivateABI' => 1,
                                      'Size' => '40',
                                      'Type' => 'Struct'
                                    },
                          '8792' => {
                                      'BaseType' => '8713',
                                      'Name' => 'struct lyxml_ns const',
                                      'Size' => '40',
                                      'Type' => 'Const'
                                    },
                          '8797' => {
                                      'BaseType' => '8713',
                                      'Name' => 'struct lyxml_ns*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '88' => {
                                    'BaseType' => '100',
                                    'Header' => undef,
                                    'Line' => '36',
                                    'Name' => '__int8_t',
                                    'PrivateABI' => 1,
                                    'Size' => '1',
                                    'Type' => 'Typedef'
                                  },
                          '8803' => {
                                      'Header' => undef,
                                      'Line' => '92',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'flags',
                                                           'offset' => '0',
                                                           'type' => '249'
                                                         },
                                                  '1' => {
                                                           'name' => 'parent',
                                                           'offset' => '8',
                                                           'type' => '8933'
                                                         },
                                                  '2' => {
                                                           'name' => 'attr',
                                                           'offset' => '16',
                                                           'type' => '9017'
                                                         },
                                                  '3' => {
                                                           'name' => 'child',
                                                           'offset' => '24',
                                                           'type' => '8933'
                                                         },
                                                  '4' => {
                                                           'name' => 'next',
                                                           'offset' => '32',
                                                           'type' => '8933'
                                                         },
                                                  '5' => {
                                                           'name' => 'prev',
                                                           'offset' => '40',
                                                           'type' => '8933'
                                                         },
                                                  '6' => {
                                                           'name' => 'name',
                                                           'offset' => '48',
                                                           'type' => '362'
                                                         },
                                                  '7' => {
                                                           'name' => 'ns',
                                                           'offset' => '56',
                                                           'type' => '9023'
                                                         },
                                                  '8' => {
                                                           'name' => 'content',
                                                           'offset' => '64',
                                                           'type' => '362'
                                                         }
                                                },
                                      'Name' => 'struct lyxml_elem',
                                      'PrivateABI' => 1,
                                      'Size' => '72',
                                      'Type' => 'Struct'
                                    },
                          '8933' => {
                                      'BaseType' => '8803',
                                      'Name' => 'struct lyxml_elem*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '8939' => {
                                      'Header' => undef,
                                      'Line' => '75',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'type',
                                                           'offset' => '0',
                                                           'type' => '8701'
                                                         },
                                                  '1' => {
                                                           'name' => 'next',
                                                           'offset' => '8',
                                                           'type' => '9017'
                                                         },
                                                  '2' => {
                                                           'name' => 'ns',
                                                           'offset' => '16',
                                                           'type' => '9023'
                                                         },
                                                  '3' => {
                                                           'name' => 'name',
                                                           'offset' => '24',
                                                           'type' => '362'
                                                         },
                                                  '4' => {
                                                           'name' => 'value',
                                                           'offset' => '32',
                                                           'type' => '362'
                                                         }
                                                },
                                      'Name' => 'struct lyxml_attr',
                                      'PrivateABI' => 1,
                                      'Size' => '40',
                                      'Type' => 'Struct'
                                    },
                          '9017' => {
                                      'BaseType' => '8939',
                                      'Name' => 'struct lyxml_attr*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '9023' => {
                                      'BaseType' => '8792',
                                      'Name' => 'struct lyxml_ns const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '9029' => {
                                      'Header' => undef,
                                      'Line' => '94',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'binary',
                                                           'offset' => '0',
                                                           'type' => '362'
                                                         },
                                                  '1' => {
                                                           'name' => 'bit',
                                                           'offset' => '0',
                                                           'type' => '9259'
                                                         },
                                                  '10' => {
                                                            'name' => 'int64',
                                                            'offset' => '0',
                                                            'type' => '1433'
                                                          },
                                                  '11' => {
                                                            'name' => 'leafref',
                                                            'offset' => '0',
                                                            'type' => '9427'
                                                          },
                                                  '12' => {
                                                            'name' => 'string',
                                                            'offset' => '0',
                                                            'type' => '362'
                                                          },
                                                  '13' => {
                                                            'name' => 'uint8',
                                                            'offset' => '0',
                                                            'type' => '1532'
                                                          },
                                                  '14' => {
                                                            'name' => 'uint16',
                                                            'offset' => '0',
                                                            'type' => '1549'
                                                          },
                                                  '15' => {
                                                            'name' => 'uint32',
                                                            'offset' => '0',
                                                            'type' => '1561'
                                                          },
                                                  '16' => {
                                                            'name' => 'uint64',
                                                            'offset' => '0',
                                                            'type' => '1573'
                                                          },
                                                  '17' => {
                                                            'name' => 'ptr',
                                                            'offset' => '0',
                                                            'type' => '241'
                                                          },
                                                  '2' => {
                                                           'name' => 'bln',
                                                           'offset' => '0',
                                                           'type' => '1397'
                                                         },
                                                  '3' => {
                                                           'name' => 'dec64',
                                                           'offset' => '0',
                                                           'type' => '1433'
                                                         },
                                                  '4' => {
                                                           'name' => 'enm',
                                                           'offset' => '0',
                                                           'type' => '6751'
                                                         },
                                                  '5' => {
                                                           'name' => 'ident',
                                                           'offset' => '0',
                                                           'type' => '4567'
                                                         },
                                                  '6' => {
                                                           'name' => 'instance',
                                                           'offset' => '0',
                                                           'type' => '9427'
                                                         },
                                                  '7' => {
                                                           'name' => 'int8',
                                                           'offset' => '0',
                                                           'type' => '1397'
                                                         },
                                                  '8' => {
                                                           'name' => 'int16',
                                                           'offset' => '0',
                                                           'type' => '1409'
                                                         },
                                                  '9' => {
                                                           'name' => 'int32',
                                                           'offset' => '0',
                                                           'type' => '1421'
                                                         }
                                                },
                                      'Name' => 'union lyd_value_u',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Union'
                                    },
                          '9259' => {
                                      'BaseType' => '6504',
                                      'Name' => 'struct lys_type_bit**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '9265' => {
                                      'Header' => undef,
                                      'Line' => '176',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'schema',
                                                           'offset' => '0',
                                                           'type' => '5384'
                                                         },
                                                  '1' => {
                                                           'name' => 'validity',
                                                           'offset' => '8',
                                                           'type' => '1532'
                                                         },
                                                  '10' => {
                                                            'name' => 'child',
                                                            'offset' => '64',
                                                            'type' => '9427'
                                                          },
                                                  '2' => {
                                                           'bitfield' => '1',
                                                           'name' => 'dflt',
                                                           'offset' => '9',
                                                           'type' => '1532'
                                                         },
                                                  '3' => {
                                                           'bitfield' => '3',
                                                           'name' => 'when_status',
                                                           'offset' => '9',
                                                           'type' => '1532'
                                                         },
                                                  '4' => {
                                                           'name' => 'attr',
                                                           'offset' => '16',
                                                           'type' => '9563'
                                                         },
                                                  '5' => {
                                                           'name' => 'next',
                                                           'offset' => '24',
                                                           'type' => '9427'
                                                         },
                                                  '6' => {
                                                           'name' => 'prev',
                                                           'offset' => '32',
                                                           'type' => '9427'
                                                         },
                                                  '7' => {
                                                           'name' => 'parent',
                                                           'offset' => '40',
                                                           'type' => '9427'
                                                         },
                                                  '8' => {
                                                           'name' => 'hash',
                                                           'offset' => '48',
                                                           'type' => '1561'
                                                         },
                                                  '9' => {
                                                           'name' => 'ht',
                                                           'offset' => '56',
                                                           'type' => '9680'
                                                         }
                                                },
                                      'Name' => 'struct lyd_node',
                                      'PrivateABI' => 1,
                                      'Size' => '72',
                                      'Type' => 'Struct'
                                    },
                          '9427' => {
                                      'BaseType' => '9265',
                                      'Name' => 'struct lyd_node*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '9433' => {
                                      'BaseType' => '9029',
                                      'Header' => undef,
                                      'Line' => '116',
                                      'Name' => 'lyd_val',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '9445' => {
                                      'Header' => undef,
                                      'Line' => '128',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'parent',
                                                           'offset' => '0',
                                                           'type' => '9427'
                                                         },
                                                  '1' => {
                                                           'name' => 'next',
                                                           'offset' => '8',
                                                           'type' => '9563'
                                                         },
                                                  '2' => {
                                                           'name' => 'annotation',
                                                           'offset' => '16',
                                                           'type' => '9569'
                                                         },
                                                  '3' => {
                                                           'name' => 'name',
                                                           'offset' => '24',
                                                           'type' => '362'
                                                         },
                                                  '4' => {
                                                           'name' => 'value_str',
                                                           'offset' => '32',
                                                           'type' => '362'
                                                         },
                                                  '5' => {
                                                           'name' => 'value',
                                                           'offset' => '40',
                                                           'type' => '9433'
                                                         },
                                                  '6' => {
                                                           'name' => 'value_type',
                                                           'offset' => '48',
                                                           'type' => '6068'
                                                         },
                                                  '7' => {
                                                           'name' => 'value_flags',
                                                           'offset' => '52',
                                                           'type' => '1532'
                                                         }
                                                },
                                      'Name' => 'struct lyd_attr',
                                      'PrivateABI' => 1,
                                      'Size' => '56',
                                      'Type' => 'Struct'
                                    },
                          '9563' => {
                                      'BaseType' => '9445',
                                      'Name' => 'struct lyd_attr*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '9569' => {
                                      'BaseType' => '3462',
                                      'Name' => 'struct lys_ext_instance_complex*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '9575' => {
                                      'Header' => undef,
                                      'Line' => '75',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'used',
                                                           'offset' => '0',
                                                           'type' => '1561'
                                                         },
                                                  '1' => {
                                                           'name' => 'size',
                                                           'offset' => '4',
                                                           'type' => '1561'
                                                         },
                                                  '2' => {
                                                           'name' => 'val_equal',
                                                           'offset' => '8',
                                                           'type' => '10657'
                                                         },
                                                  '3' => {
                                                           'name' => 'cb_data',
                                                           'offset' => '16',
                                                           'type' => '241'
                                                         },
                                                  '4' => {
                                                           'name' => 'resize',
                                                           'offset' => '24',
                                                           'type' => '1549'
                                                         },
                                                  '5' => {
                                                           'name' => 'rec_size',
                                                           'offset' => '26',
                                                           'type' => '1549'
                                                         },
                                                  '6' => {
                                                           'name' => 'recs',
                                                           'offset' => '32',
                                                           'type' => '10705'
                                                         }
                                                },
                                      'Name' => 'struct hash_table',
                                      'PrivateABI' => 1,
                                      'Size' => '40',
                                      'Type' => 'Struct'
                                    },
                          '9680' => {
                                      'BaseType' => '9575',
                                      'Name' => 'struct hash_table*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '9686' => {
                                      'BaseType' => '9427',
                                      'Name' => 'struct lyd_node**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '9692' => {
                                      'BaseType' => '9705',
                                      'Header' => 'libyang.h',
                                      'Line' => '1469',
                                      'Name' => 'ly_module_imp_clb',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '9705' => {
                                      'Name' => 'char const*(*)(char const*, char const*, char const*, char const*, void*, , void(**)(void*, void*))',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '362'
                                                          },
                                                   '1' => {
                                                            'type' => '362'
                                                          },
                                                   '2' => {
                                                            'type' => '362'
                                                          },
                                                   '3' => {
                                                            'type' => '362'
                                                          },
                                                   '4' => {
                                                            'type' => '241'
                                                          },
                                                   '5' => {
                                                            'type' => '9756'
                                                          },
                                                   '6' => {
                                                            'type' => '9762'
                                                          }
                                                 },
                                      'Return' => '362',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '9762' => {
                                      'BaseType' => '9768',
                                      'Name' => 'void(**)(void*, void*)',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '9768' => {
                                      'Name' => 'void(*)(void*, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '241'
                                                          },
                                                   '1' => {
                                                            'type' => '241'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '9790' => {
                                      'BaseType' => '9803',
                                      'Header' => 'libyang.h',
                                      'Line' => '1504',
                                      'Name' => 'ly_module_data_clb',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '9803' => {
                                      'Name' => 'struct lys_module const*(*)(struct ly_ctx*, char const*, char const*, int, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '3830'
                                                          },
                                                   '1' => {
                                                            'type' => '362'
                                                          },
                                                   '2' => {
                                                            'type' => '362'
                                                          },
                                                   '3' => {
                                                            'type' => '162'
                                                          },
                                                   '4' => {
                                                            'type' => '241'
                                                          }
                                                 },
                                      'Return' => '9844',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '9844' => {
                                      'BaseType' => '3347',
                                      'Name' => 'struct lys_module const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '9850' => {
                                      'Header' => 'libyang.h',
                                      'Line' => '1691',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 's',
                                                           'offset' => '0',
                                                           'type' => '9898'
                                                         },
                                                  '1' => {
                                                           'name' => 'd',
                                                           'offset' => '0',
                                                           'type' => '9686'
                                                         },
                                                  '2' => {
                                                           'name' => 'g',
                                                           'offset' => '0',
                                                           'type' => '7335'
                                                         }
                                                },
                                      'Name' => 'union ly_set_set',
                                      'Size' => '8',
                                      'Type' => 'Union'
                                    },
                          '9898' => {
                                      'BaseType' => '5384',
                                      'Name' => 'struct lys_node**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    }
                        },
          'UndefinedSymbols' => {
                                  'libyang.so.1.8.4' => {
                                                          '_ITM_deregisterTMCloneTable' => 0,
                                                          '_ITM_registerTMCloneTable' => 0,
                                                          '__assert_fail@GLIBC_2.2.5' => 0,
                                                          '__ctype_b_loc@GLIBC_2.3' => 0,
                                                          '__ctype_tolower_loc@GLIBC_2.3' => 0,
                                                          '__cxa_finalize@GLIBC_2.2.5' => 0,
                                                          '__errno_location@GLIBC_2.2.5' => 0,
                                                          '__fxstat@GLIBC_2.2.5' => 0,
                                                          '__gmon_start__' => 0,
                                                          '__tls_get_addr@GLIBC_2.3' => 0,
                                                          '__xstat@GLIBC_2.2.5' => 0,
                                                          'access@GLIBC_2.2.5' => 0,
                                                          'asprintf@GLIBC_2.2.5' => 0,
                                                          'calloc@GLIBC_2.2.5' => 0,
                                                          'clearerr@GLIBC_2.2.5' => 0,
                                                          'close@GLIBC_2.2.5' => 0,
                                                          'closedir@GLIBC_2.2.5' => 0,
                                                          'dlclose@GLIBC_2.2.5' => 0,
                                                          'dlerror@GLIBC_2.2.5' => 0,
                                                          'dlopen@GLIBC_2.2.5' => 0,
                                                          'dlsym@GLIBC_2.2.5' => 0,
                                                          'exit@GLIBC_2.2.5' => 0,
                                                          'fclose@GLIBC_2.2.5' => 0,
                                                          'ferror@GLIBC_2.2.5' => 0,
                                                          'fflush@GLIBC_2.2.5' => 0,
                                                          'fileno@GLIBC_2.2.5' => 0,
                                                          'fopen@GLIBC_2.2.5' => 0,
                                                          'fprintf@GLIBC_2.2.5' => 0,
                                                          'fread@GLIBC_2.2.5' => 0,
                                                          'free@GLIBC_2.2.5' => 0,
                                                          'fwrite@GLIBC_2.2.5' => 0,
                                                          'get_current_dir_name@GLIBC_2.2.5' => 0,
                                                          'getc@GLIBC_2.2.5' => 0,
                                                          'getenv@GLIBC_2.2.5' => 0,
                                                          'isatty@GLIBC_2.2.5' => 0,
                                                          'malloc@GLIBC_2.2.5' => 0,
                                                          'memcmp@GLIBC_2.2.5' => 0,
                                                          'memcpy@GLIBC_2.14' => 0,
                                                          'memmove@GLIBC_2.2.5' => 0,
                                                          'memset@GLIBC_2.2.5' => 0,
                                                          'mktime@GLIBC_2.2.5' => 0,
                                                          'mmap@GLIBC_2.2.5' => 0,
                                                          'munmap@GLIBC_2.2.5' => 0,
                                                          'open@GLIBC_2.2.5' => 0,
                                                          'opendir@GLIBC_2.2.5' => 0,
                                                          'pcre_compile' => 0,
                                                          'pcre_exec' => 0,
                                                          'pcre_free' => 0,
                                                          'pcre_free_study' => 0,
                                                          'pcre_study' => 0,
                                                          'pthread_getspecific@GLIBC_2.2.5' => 0,
                                                          'pthread_key_create@GLIBC_2.2.5' => 0,
                                                          'pthread_key_delete@GLIBC_2.2.5' => 0,
                                                          'pthread_mutex_destroy@GLIBC_2.2.5' => 0,
                                                          'pthread_mutex_init@GLIBC_2.2.5' => 0,
                                                          'pthread_mutex_lock@GLIBC_2.2.5' => 0,
                                                          'pthread_mutex_unlock@GLIBC_2.2.5' => 0,
                                                          'pthread_setspecific@GLIBC_2.2.5' => 0,
                                                          'qsort@GLIBC_2.2.5' => 0,
                                                          'readdir@GLIBC_2.2.5' => 0,
                                                          'readlink@GLIBC_2.2.5' => 0,
                                                          'realloc@GLIBC_2.2.5' => 0,
                                                          'realpath@GLIBC_2.3' => 0,
                                                          'sprintf@GLIBC_2.2.5' => 0,
                                                          'stderr@GLIBC_2.2.5' => 0,
                                                          'stdin@GLIBC_2.2.5' => 0,
                                                          'stdout@GLIBC_2.2.5' => 0,
                                                          'strcat@GLIBC_2.2.5' => 0,
                                                          'strchr@GLIBC_2.2.5' => 0,
                                                          'strcmp@GLIBC_2.2.5' => 0,
                                                          'strcpy@GLIBC_2.2.5' => 0,
                                                          'strdup@GLIBC_2.2.5' => 0,
                                                          'strerror@GLIBC_2.2.5' => 0,
                                                          'strncmp@GLIBC_2.2.5' => 0,
                                                          'strncpy@GLIBC_2.2.5' => 0,
                                                          'strndup@GLIBC_2.2.5' => 0,
                                                          'strpbrk@GLIBC_2.2.5' => 0,
                                                          'strptime@GLIBC_2.2.5' => 0,
                                                          'strrchr@GLIBC_2.2.5' => 0,
                                                          'strstr@GLIBC_2.2.5' => 0,
                                                          'strtod@GLIBC_2.2.5' => 0,
                                                          'strtok_r@GLIBC_2.2.5' => 0,
                                                          'strtol@GLIBC_2.2.5' => 0,
                                                          'strtold@GLIBC_2.2.5' => 0,
                                                          'strtoll@GLIBC_2.2.5' => 0,
                                                          'strtoul@GLIBC_2.2.5' => 0,
                                                          'strtoull@GLIBC_2.2.5' => 0,
                                                          'sysconf@GLIBC_2.2.5' => 0,
                                                          'vasprintf@GLIBC_2.2.5' => 0,
                                                          'vdprintf@GLIBC_2.2.5' => 0,
                                                          'vfprintf@GLIBC_2.2.5' => 0,
                                                          'write@GLIBC_2.2.5' => 0
                                                        }
                                },
          'WordSize' => '8'
        };
